CREATE TEMP TABLE Cities 
(
 "Name" character varying(50)
);

INSERT INTO Cities("Name")
	VALUES 
	('Архангельск'), 
	('Астрахань'), 
	('Белгород'), 
	('Биробиджан'), 
	('Благовещенск'), 
	('Брянск'), 
	('Великий Новгород'),
	('Владимир'), 
	('Волгоград'), 
	('Вологда'), 
	('Воронеж'), 
	('Гатчина'), 
	('Екатеринбург'), 
	('Иваново'), 
	('Иркутск'),
	('Калининград'), 
	('Калуга'), 
	('Кемерово'), 
	('Киров'), 
	('Кострома'), 
	('Красногорск'), 
	('Курган'), 
	('Курск'), 
	('Липецк'),
	('Магадан'), 
	('Москва'), 
	('Мурманск'), 
	('Нижний Новгород'), 
	('Новосибирск'), 
	('Омск'), 
	('Орёл'), 
	('Оренбург'), 
	('Пенза'),
	('Псков'), 
	('Ростов-на-Дону'), 
	('Рязань'), 
	('Самара'), 
	('Санкт-Петербург'), 
	('Саратов'), 
	('Смоленск'), 
	('Тамбов'), 
	('Тверь'),
	('Томск'), 
	('Тула'), 
	('Тюмень'), 
	('Ульяновск'), 
	('Челябинск'), 
	('Южно-Сахалинск'), 
	('Ярославль');


insert into public."LocationNode"
	("Code", "Name")
select 
	'A' || TO_CHAR(ROW_NUMBER() OVER(), 'fm00'),
	"Name"
from Cities

